; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :action-costs :strips :typing)
  (:types
    phys_object location crate_type num container - object
    helicopter victim crate carrier - phys_object
    helicopter carrier - container
    )
  (:constants
    food_crate medicine_crate - crate_type
    depot - location


    n0 n1 n2 n3 n4 - num
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    (contains ?h - container ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    (nb_loaded_crates ?r - carrier ?n - num)

    (next ?numA - num ?numB - num)
    )

  (:functions
    (total-cost) - number
    (fly-cost ?from - location ?to - location) - number
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    (increase (total-cost) (fly-cost ?from ?to))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (contains ?h ?c)
    (not (at ?c ?l))
    (increase (total-cost) 10)
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (contains ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (contains ?h ?c))
    (has_crate ?v ?t)
    (increase (total-cost) 10)
    )
   )

  (:action load_crate_on_carrier
   :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
   :precondition
   (and
    (at ?h ?l)
    (at ?r ?l)
    (contains ?h ?c)
    (nb_loaded_crates ?r ?nb_loaded)
    (next ?nb_loaded ?new_nb_loaded)
    )
   :effect
   (and
     (not (nb_loaded_crates ?r ?nb_loaded))
     (nb_loaded_crates ?r ?new_nb_loaded)
     (not (contains ?h ?c))
     (contains ?r ?c)
     (increase (total-cost) 10)
     (empty ?h)
     )
   )

  (:action fly_carrier
    :parameters (?h - helicopter ?r - carrier ?from - location ?to - location)
    :precondition
    (and
      (empty ?h)
      (at ?h ?from)
      (at ?r ?from)
      )
    :effect
    (and
      (not (at ?h ?from)) (at ?h ?to)
      (not (at ?r ?from)) (at ?r ?to)
      (increase (total-cost) (fly-cost ?from ?to))
      )
    )

  (:action take_crate_from_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?r ?c)
      (empty ?h)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?new_nb_loaded ?nb_loaded)
      )
    :effect
    (and
      (not (contains ?r ?c))
      (not (empty ?h))
      (contains ?h ?c)
      (not (nb_loaded_crates ?r ?nb_loaded)) (nb_loaded_crates ?r ?new_nb_loaded)
      (increase (total-cost) 10)
      )
    )
  )

; problem
(define (problem helicopter_problem_4_1_10_10_5c2c3_5)
(:domain EMERGENCY_SERVICES_LOGISTICS)
(:objects
	helicopter1 - helicopter
	helicopter2 - helicopter
	helicopter3 - helicopter
	helicopter4 - helicopter
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	food_crate - crate_type
	medicine_crate - crate_type
	person1 - victim
	person2 - victim
	person3 - victim
	person4 - victim
	person5 - victim
	person6 - victim
	person7 - victim
	person8 - victim
	person9 - victim
	person10 - victim
	carrier1 - carrier
)
(:init
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
	(= (total-cost) 0)
	(is_type crate1 food_crate)
	(at crate1 depot)
	(can_be_taken crate1)
	(is_type crate2 food_crate)
	(at crate2 depot)
	(can_be_taken crate2)
	(is_type crate3 medicine_crate)
	(at crate3 depot)
	(can_be_taken crate3)
	(is_type crate4 medicine_crate)
	(at crate4 depot)
	(can_be_taken crate4)
	(is_type crate5 medicine_crate)
	(at crate5 depot)
	(can_be_taken crate5)
	(at helicopter1 depot)
	(empty helicopter1)
	(at helicopter2 depot)
	(empty helicopter2)
	(at helicopter3 depot)
	(empty helicopter3)
	(at helicopter4 depot)
	(empty helicopter4)
	(at person1 loc7)
	(at person2 loc9)
	(at person3 loc10)
	(at person4 loc9)
	(at person5 loc3)
	(at person6 loc10)
	(at person7 loc7)
	(at person8 loc4)
	(at person9 loc7)
	(at person10 loc7)
	(at carrier1  depot)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 144)
	(= (fly-cost depot loc2) 202)
	(= (fly-cost depot loc3) 156)
	(= (fly-cost depot loc4) 242)
	(= (fly-cost depot loc5) 265)
	(= (fly-cost depot loc6) 66)
	(= (fly-cost depot loc7) 173)
	(= (fly-cost depot loc8) 189)
	(= (fly-cost depot loc9) 74)
	(= (fly-cost depot loc10) 185)
	(= (fly-cost loc1 depot) 144)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 65)
	(= (fly-cost loc1 loc3) 27)
	(= (fly-cost loc1 loc4) 105)
	(= (fly-cost loc1 loc5) 122)
	(= (fly-cost loc1 loc6) 101)
	(= (fly-cost loc1 loc7) 32)
	(= (fly-cost loc1 loc8) 65)
	(= (fly-cost loc1 loc9) 89)
	(= (fly-cost loc1 loc10) 121)
	(= (fly-cost loc2 depot) 202)
	(= (fly-cost loc2 loc1) 65)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 74)
	(= (fly-cost loc2 loc4) 90)
	(= (fly-cost loc2 loc5) 70)
	(= (fly-cost loc2 loc6) 148)
	(= (fly-cost loc2 loc7) 55)
	(= (fly-cost loc2 loc8) 26)
	(= (fly-cost loc2 loc9) 136)
	(= (fly-cost loc2 loc10) 165)
	(= (fly-cost loc3 depot) 156)
	(= (fly-cost loc3 loc1) 27)
	(= (fly-cost loc3 loc2) 74)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 87)
	(= (fly-cost loc3 loc5) 117)
	(= (fly-cost loc3 loc6) 122)
	(= (fly-cost loc3 loc7) 22)
	(= (fly-cost loc3 loc8) 82)
	(= (fly-cost loc3 loc9) 111)
	(= (fly-cost loc3 loc10) 97)
	(= (fly-cost loc4 depot) 242)
	(= (fly-cost loc4 loc1) 105)
	(= (fly-cost loc4 loc2) 90)
	(= (fly-cost loc4 loc3) 87)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 64)
	(= (fly-cost loc4 loc6) 206)
	(= (fly-cost loc4 loc7) 74)
	(= (fly-cost loc4 loc8) 114)
	(= (fly-cost loc4 loc9) 194)
	(= (fly-cost loc4 loc10) 122)
	(= (fly-cost loc5 depot) 265)
	(= (fly-cost loc5 loc1) 122)
	(= (fly-cost loc5 loc2) 70)
	(= (fly-cost loc5 loc3) 117)
	(= (fly-cost loc5 loc4) 64)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 215)
	(= (fly-cost loc5 loc7) 96)
	(= (fly-cost loc5 loc8) 93)
	(= (fly-cost loc5 loc9) 203)
	(= (fly-cost loc5 loc10) 181)
	(= (fly-cost loc6 depot) 66)
	(= (fly-cost loc6 loc1) 101)
	(= (fly-cost loc6 loc2) 148)
	(= (fly-cost loc6 loc3) 122)
	(= (fly-cost loc6 loc4) 206)
	(= (fly-cost loc6 loc5) 215)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 132)
	(= (fly-cost loc6 loc8) 131)
	(= (fly-cost loc6 loc9) 13)
	(= (fly-cost loc6 loc10) 184)
	(= (fly-cost loc7 depot) 173)
	(= (fly-cost loc7 loc1) 32)
	(= (fly-cost loc7 loc2) 55)
	(= (fly-cost loc7 loc3) 22)
	(= (fly-cost loc7 loc4) 74)
	(= (fly-cost loc7 loc5) 96)
	(= (fly-cost loc7 loc6) 132)
	(= (fly-cost loc7 loc7) 1)
	(= (fly-cost loc7 loc8) 67)
	(= (fly-cost loc7 loc9) 120)
	(= (fly-cost loc7 loc10) 112)
	(= (fly-cost loc8 depot) 189)
	(= (fly-cost loc8 loc1) 65)
	(= (fly-cost loc8 loc2) 26)
	(= (fly-cost loc8 loc3) 82)
	(= (fly-cost loc8 loc4) 114)
	(= (fly-cost loc8 loc5) 93)
	(= (fly-cost loc8 loc6) 131)
	(= (fly-cost loc8 loc7) 67)
	(= (fly-cost loc8 loc8) 1)
	(= (fly-cost loc8 loc9) 119)
	(= (fly-cost loc8 loc10) 177)
	(= (fly-cost loc9 depot) 74)
	(= (fly-cost loc9 loc1) 89)
	(= (fly-cost loc9 loc2) 136)
	(= (fly-cost loc9 loc3) 111)
	(= (fly-cost loc9 loc4) 194)
	(= (fly-cost loc9 loc5) 203)
	(= (fly-cost loc9 loc6) 13)
	(= (fly-cost loc9 loc7) 120)
	(= (fly-cost loc9 loc8) 119)
	(= (fly-cost loc9 loc9) 1)
	(= (fly-cost loc9 loc10) 177)
	(= (fly-cost loc10 depot) 185)
	(= (fly-cost loc10 loc1) 121)
	(= (fly-cost loc10 loc2) 165)
	(= (fly-cost loc10 loc3) 97)
	(= (fly-cost loc10 loc4) 122)
	(= (fly-cost loc10 loc5) 181)
	(= (fly-cost loc10 loc6) 184)
	(= (fly-cost loc10 loc7) 112)
	(= (fly-cost loc10 loc8) 177)
	(= (fly-cost loc10 loc9) 177)
	(= (fly-cost loc10 loc10) 1)
)
(:goal (and

	(at helicopter1 depot)

	(at helicopter2 depot)

	(at helicopter3 depot)

	(at helicopter4 depot)
	(has_crate person2 medicine_crate)
	(has_crate person6 food_crate)
	(has_crate person8 medicine_crate)
	(has_crate person9 medicine_crate)
	(has_crate person10 food_crate)
	))
)

; plan
1. (pick_up helicopter2 crate4 depot)
   deleted: (empty helicopter2) (can_be_taken crate4) (at crate4 depot)
   added: (contains helicopter2 crate4)
   goals met: 4 of 9
2. (pick_up helicopter1 crate2 depot)
   deleted: (empty helicopter1) (can_be_taken crate2) (at crate2 depot)
   added: (contains helicopter1 crate2)
   goals met: 4 of 9
3. (pick_up helicopter3 crate1 depot)
   deleted: (empty helicopter3) (can_be_taken crate1) (at crate1 depot)
   added: (contains helicopter3 crate1)
   goals met: 4 of 9
4. (move helicopter2 depot loc9)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc9)
   goals met: 3 of 9
5. (move helicopter3 depot loc7)
   deleted: (at helicopter3 depot)
   added: (at helicopter3 loc7)
   goals met: 2 of 9
6. (move helicopter1 depot loc10)
   deleted: (at helicopter1 depot)
   added: (at helicopter1 loc10)
   goals met: 1 of 9
7. (give helicopter2 crate4 person2 loc9 medicine_crate)
   deleted: (contains helicopter2 crate4)
   added: (empty helicopter2) (can_be_taken crate4) (has_crate person2 medicine_crate)
   goals met: 2 of 9
8. (move helicopter2 loc9 loc10)
   deleted: (at helicopter2 loc9)
   added: (at helicopter2 loc10)
   goals met: 2 of 9
9. (give helicopter3 crate1 person10 loc7 food_crate)
   deleted: (contains helicopter3 crate1)
   added: (empty helicopter3) (can_be_taken crate1) (has_crate person10 food_crate)
   goals met: 3 of 9
10. (move helicopter3 loc7 depot)
   deleted: (at helicopter3 loc7)
   added: (at helicopter3 depot)
   goals met: 4 of 9
11. (give helicopter1 crate2 person6 loc10 food_crate)
   deleted: (contains helicopter1 crate2)
   added: (empty helicopter1) (can_be_taken crate2) (has_crate person6 food_crate)
   goals met: 5 of 9
12. (move helicopter1 loc10 loc4)
   deleted: (at helicopter1 loc10)
   added: (at helicopter1 loc4)
   goals met: 5 of 9
13. (move helicopter2 loc10 loc4)
   deleted: (at helicopter2 loc10)
   added: (at helicopter2 loc4)
   goals met: 5 of 9
14. (move helicopter1 loc4 depot)
   deleted: (at helicopter1 loc4)
   added: (at helicopter1 depot)
   goals met: 6 of 9
15. (move helicopter2 loc4 loc7)
   deleted: (at helicopter2 loc4)
   added: (at helicopter2 loc7)
   goals met: 6 of 9
16. (move helicopter2 loc7 depot)
   deleted: (at helicopter2 loc7)
   added: (at helicopter2 depot)
   goals met: 7 of 9
17. (pick_up helicopter2 crate3 depot)
   deleted: (empty helicopter2) (can_be_taken crate3) (at crate3 depot)
   added: (contains helicopter2 crate3)
   goals met: 7 of 9
18. (move helicopter2 depot loc4)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc4)
   goals met: 6 of 9
19. (give helicopter2 crate3 person8 loc4 medicine_crate)
   deleted: (contains helicopter2 crate3)
   added: (empty helicopter2) (can_be_taken crate3) (has_crate person8 medicine_crate)
   goals met: 7 of 9
20. (move helicopter2 loc4 loc7)
   deleted: (at helicopter2 loc4)
   added: (at helicopter2 loc7)
   goals met: 7 of 9
21. (move helicopter2 loc7 depot)
   deleted: (at helicopter2 loc7)
   added: (at helicopter2 depot)
   goals met: 8 of 9
22. (pick_up helicopter2 crate5 depot)
   deleted: (empty helicopter2) (can_be_taken crate5) (at crate5 depot)
   added: (contains helicopter2 crate5)
   goals met: 8 of 9
23. (move helicopter2 depot loc7)
   deleted: (at helicopter2 depot)
   added: (at helicopter2 loc7)
   goals met: 7 of 9
24. (give helicopter2 crate5 person9 loc7 medicine_crate)
   deleted: (contains helicopter2 crate5)
   added: (empty helicopter2) (can_be_taken crate5) (has_crate person9 medicine_crate)
   goals met: 8 of 9
25. (move helicopter2 loc7 depot)
   deleted: (at helicopter2 loc7)
   added: (at helicopter2 depot)
   goals met: 9 of 9
